# PanelConnectedLabel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalLoadClassification..::..PanelConnectedLabel Property
ElectricalLoadClassification Class See Also
---
The name template for the connected load parameter of the load classification.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string PanelConnectedLabel { get; set; }
```

Visual Basic
---
```text
Public Property PanelConnectedLabel As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ PanelConnectedLabel {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: panelConnectedLabel is not a valid globalization format string. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace